/*Описати своїми словами у кілька рядків, навіщо у програмуванні потрібні цикли.
    Циклы нужны для того, что бы повторить одну операцию столько раз сколько нам нужно.
*/
/*Опишіть у яких ситуаціях ви використовували той чи інший цикл в JS.
    Например пройти через значения массива или обьекта, найти нужное нам 
    и прервать цикл. 
*/

/*Що таке явне та неявне приведення (перетворення) типів даних у JS? 
    Это такой вид приобразавания который считается принудительным,
    когда происходит компиляция тип автоматически приводятся к одному.
*/


let yourNumber = prompt('Введите число');
let myArray = [];
const REGULAR_WORD = /\D/g;

if (REGULAR_WORD.test(yourNumber)) {
    console.log('Sorry, no numbers');
};

for (let i = 0; i <= yourNumber; i++) {
    if (yourNumber < 5 ) {
        console.log('Sorry, no numbers');
        break;
    } else if (i % 5 === 0) {
        myArray.push(i);
    };
};

console.log(myArray);



